conf/src/InformationRegisters/ЭП_ВиртуальныеЭтапыПроектов/ЭП_ВиртуальныеЭтапыПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ВиртуальныеЭтапыПроектов</name>
  <resources>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодБИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВиртуальныйЭтап</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВиртуальныйЭтапСсылка</name>
    <type>
      <types>CatalogRef.ЭП_ВиртуальныеЭтапы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/InformationRegisters/ЭП_ВиртуальныеЭтапыПроектов/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ВиртуальныйЭтапСсылкаПриИзмененииНаСервере()
	ОбъектРазделыПроекта = Запись.ВиртуальныйЭтапСсылка.ПолучитьОбъект();
	Запись.ВиртуальныйЭтап = ОбъектРазделыПроекта.Ссылка;
	Запись.ДатаПо = ОбъектРазделыПроекта.ДатаНачала; 
	Запись.ДатаС = ОбъектРазделыПроекта.ДатаОкончания;
	Запись.КодБИ = ОбъектРазделыПроекта.ЭП_КодBI;
КонецПроцедуры

&НаКлиенте
Процедура ВиртуальныйЭтапСсылкаПриИзменении(Элемент)
	ВиртуальныйЭтапСсылкаПриИзмененииНаСервере();
КонецПроцедуры
